Revit 2027 API
Settings.TilePatterns Property
 Retrieves an object that provides access to the TilePattern objects in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TilePatterns TilePatterns { get; }
Public ReadOnly Property TilePatterns As TilePatterns
	Get
public:
property TilePatterns^ TilePatterns {
	TilePatterns^ get ();
}
member TilePatterns : TilePatterns with get
Property Value
TilePatterns
See Also
Reference
Settings Class
Autodesk.Revit.DB Namespace